      *Player hand calculation

           IF WK-CARD1 = "2"
              ADD 1 TO WK-2PLAYS
              MOVE 1 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "2"
              ADD 1 TO WK-2PLAYS
              MOVE 1 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "2"
              ADD 1 TO WK-2PLAYS
           END-IF.
           IF WK-CARD4 = "2"
              ADD 1 TO WK-2PLAYS
           END-IF.
           IF WK-CARD5 = "2"
              ADD 1 TO WK-2PLAYS
           END-IF.
           IF WK-CARDTABLE1 = "2"
              ADD 1 TO WK-2PLAYS
           END-IF.
           IF WK-CARDTABLE2 = "2"
              ADD 1 TO WK-2PLAYS
           END-IF.
           IF WK-CARDTABLE3 = "2"
              ADD 1 TO WK-2PLAYS
           END-IF.
           IF WK-CARDTABLE4 = "2"
              ADD 1 TO WK-2PLAYS
           END-IF.
           IF WK-CARDTABLE5 = "2"
              ADD 1 TO WK-2PLAYS
           END-IF.


           IF WK-CARD1 = "3"
              ADD 1 TO WK-3PLAYS
              MOVE 2 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "3"
              ADD 1 TO WK-3PLAYS
              MOVE 2 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "3"
              ADD 1 TO WK-3PLAYS
           END-IF.
           IF WK-CARD4 = "3"
              ADD 1 TO WK-3PLAYS
           END-IF.
           IF WK-CARD5 = "3"
              ADD 1 TO WK-3PLAYS
           END-IF.
           IF WK-CARDTABLE1 = "3"
              ADD 1 TO WK-3PLAYS
           END-IF.
           IF WK-CARDTABLE2 = "3"
              ADD 1 TO WK-3PLAYS
           END-IF.
           IF WK-CARDTABLE3 = "3"
              ADD 1 TO WK-3PLAYS
           END-IF.
           IF WK-CARDTABLE4 = "3"
              ADD 1 TO WK-3PLAYS
           END-IF.
           IF WK-CARDTABLE5 = "3"
              ADD 1 TO WK-3PLAYS
           END-IF.


           IF WK-CARD1 = "4"
              ADD 1 TO WK-4PLAYS
              MOVE 3 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "4"
              ADD 1 TO WK-4PLAYS
              MOVE 3 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "4"
              ADD 1 TO WK-4PLAYS
           END-IF.
           IF WK-CARD4 = "4"
              ADD 1 TO WK-4PLAYS
           END-IF.
           IF WK-CARD5 = "4"
              ADD 1 TO WK-4PLAYS
           END-IF.
           IF WK-CARDTABLE1 = "4"
              ADD 1 TO WK-4PLAYS
           END-IF.
           IF WK-CARDTABLE2 = "4"
              ADD 1 TO WK-4PLAYS
           END-IF.
           IF WK-CARDTABLE3 = "4"
              ADD 1 TO WK-4PLAYS
           END-IF.
           IF WK-CARDTABLE4 = "4"
              ADD 1 TO WK-4PLAYS
           END-IF.
           IF WK-CARDTABLE5 = "4"
              ADD 1 TO WK-4PLAYS
           END-IF.


           IF WK-CARD1 = "5"
              ADD 1 TO WK-5PLAYS
              MOVE 4 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "5"
              ADD 1 TO WK-5PLAYS
              MOVE 4 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "5"
              ADD 1 TO WK-5PLAYS
           END-IF.
           IF WK-CARD4 = "5"
              ADD 1 TO WK-5PLAYS
           END-IF.
           IF WK-CARD5 = "5"
              ADD 1 TO WK-5PLAYS
           END-IF.
           IF WK-CARDTABLE1 = "5"
              ADD 1 TO WK-5PLAYS
           END-IF.
           IF WK-CARDTABLE2 = "5"
              ADD 1 TO WK-5PLAYS
           END-IF.
           IF WK-CARDTABLE3 = "5"
              ADD 1 TO WK-5PLAYS
           END-IF.
           IF WK-CARDTABLE4 = "5"
              ADD 1 TO WK-5PLAYS
           END-IF.
           IF WK-CARDTABLE5 = "5"
              ADD 1 TO WK-5PLAYS
           END-IF.


           IF WK-CARD1 = "6"
              ADD 1 TO WK-6PLAYS
              MOVE 5 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "6"
              ADD 1 TO WK-6PLAYS
              MOVE 5 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "6"
              ADD 1 TO WK-6PLAYS
           END-IF.
           IF WK-CARD4 = "6"
              ADD 1 TO WK-6PLAYS
           END-IF.
           IF WK-CARD5 = "6"
              ADD 1 TO WK-6PLAYS
           END-IF.
           IF WK-CARDTABLE1 = "6"
              ADD 1 TO WK-6PLAYS
           END-IF.
           IF WK-CARDTABLE2 = "6"
              ADD 1 TO WK-6PLAYS
           END-IF.
           IF WK-CARDTABLE3 = "6"
              ADD 1 TO WK-6PLAYS
           END-IF.
           IF WK-CARDTABLE4 = "6"
              ADD 1 TO WK-6PLAYS
           END-IF.
           IF WK-CARDTABLE5 = "6"
              ADD 1 TO WK-6PLAYS
           END-IF.


           IF WK-CARD1 = "7"
              ADD 1 TO WK-7PLAYS
              MOVE 6 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "7"
              ADD 1 TO WK-7PLAYS
              MOVE 6 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "7"
              ADD 1 TO WK-7PLAYS
           END-IF.
           IF WK-CARD4 = "7"
              ADD 1 TO WK-7PLAYS
           END-IF.
           IF WK-CARD5 = "7"
              ADD 1 TO WK-7PLAYS
           END-IF.
           IF WK-CARDTABLE1 = "7"
              ADD 1 TO WK-7PLAYS
           END-IF.
           IF WK-CARDTABLE2 = "7"
              ADD 1 TO WK-7PLAYS
           END-IF.
           IF WK-CARDTABLE3 = "7"
              ADD 1 TO WK-7PLAYS
           END-IF.
           IF WK-CARDTABLE4 = "7"
              ADD 1 TO WK-7PLAYS
           END-IF.
           IF WK-CARDTABLE5 = "7"
              ADD 1 TO WK-7PLAYS
           END-IF.


           IF WK-CARD1 = "8"
              ADD 1 TO WK-8PLAYS
              MOVE 7 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "8"
              ADD 1 TO WK-8PLAYS
              MOVE 7 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "8"
              ADD 1 TO WK-8PLAYS
           END-IF.
           IF WK-CARD4 = "8"
              ADD 1 TO WK-8PLAYS
           END-IF.
           IF WK-CARD5 = "8"
              ADD 1 TO WK-8PLAYS
           END-IF.
           IF WK-CARDTABLE1 = "8"
              ADD 1 TO WK-8PLAYS
           END-IF.
           IF WK-CARDTABLE2 = "8"
              ADD 1 TO WK-8PLAYS
           END-IF.
           IF WK-CARDTABLE3 = "8"
              ADD 1 TO WK-8PLAYS
           END-IF.
           IF WK-CARDTABLE4 = "8"
              ADD 1 TO WK-8PLAYS
           END-IF.
           IF WK-CARDTABLE5 = "8"
              ADD 1 TO WK-8PLAYS
           END-IF.


           IF WK-CARD1 = "9"
              ADD 1 TO WK-9PLAYS
              MOVE 8 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "9"
              ADD 1 TO WK-9PLAYS
              MOVE 8 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "9"
              ADD 1 TO WK-9PLAYS
           END-IF.
           IF WK-CARD4 = "9"
              ADD 1 TO WK-9PLAYS
           END-IF.
           IF WK-CARD5 = "9"
              ADD 1 TO WK-9PLAYS
           END-IF.
           IF WK-CARDTABLE1 = "9"
              ADD 1 TO WK-9PLAYS
           END-IF.
           IF WK-CARDTABLE2 = "9"
              ADD 1 TO WK-9PLAYS
           END-IF.
           IF WK-CARDTABLE3 = "9"
              ADD 1 TO WK-9PLAYS
           END-IF.
           IF WK-CARDTABLE4 = "9"
              ADD 1 TO WK-9PLAYS
           END-IF.
           IF WK-CARDTABLE5 = "9"
              ADD 1 TO WK-9PLAYS
           END-IF.


           IF WK-CARD1 = "10"
              ADD 1 TO WK-10PLAYS
              MOVE 9 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "10"
              ADD 1 TO WK-10PLAYS
              MOVE 9 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "10"
              ADD 1 TO WK-10PLAYS
           END-IF.
           IF WK-CARD4 = "10"
              ADD 1 TO WK-10PLAYS
           END-IF.
           IF WK-CARD5 = "10"
              ADD 1 TO WK-10PLAYS
           END-IF.
           IF WK-CARDTABLE1 = "10"
              ADD 1 TO WK-10PLAYS
           END-IF.
           IF WK-CARDTABLE2 = "10"
              ADD 1 TO WK-10PLAYS
           END-IF.
           IF WK-CARDTABLE3 = "10"
              ADD 1 TO WK-10PLAYS
           END-IF.
           IF WK-CARDTABLE4 = "10"
              ADD 1 TO WK-10PLAYS
           END-IF.
           IF WK-CARDTABLE5 = "10"
              ADD 1 TO WK-10PLAYS
           END-IF.


           IF WK-CARD1 = "J"
              ADD 1 TO WK-JPLAYS
              MOVE 10 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "J"
              ADD 1 TO WK-JPLAYS
              MOVE 10 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "J"
              ADD 1 TO WK-JPLAYS
           END-IF.
           IF WK-CARD4 = "J"
              ADD 1 TO WK-JPLAYS
           END-IF.
           IF WK-CARD5 = "J"
              ADD 1 TO WK-JPLAYS
           END-IF.
           IF WK-CARDTABLE1 = "J"
              ADD 1 TO WK-JPLAYS
           END-IF.
           IF WK-CARDTABLE2 = "J"
              ADD 1 TO WK-JPLAYS
           END-IF.
           IF WK-CARDTABLE3 = "J"
              ADD 1 TO WK-JPLAYS
           END-IF.
           IF WK-CARDTABLE4 = "J"
              ADD 1 TO WK-JPLAYS
           END-IF.
           IF WK-CARDTABLE5 = "J"
              ADD 1 TO WK-JPLAYS
           END-IF.


           IF WK-CARD1 = "Q"
              ADD 1 TO WK-QPLAYS
              MOVE 11 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "Q"
              ADD 1 TO WK-QPLAYS
              MOVE 11 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "Q"
              ADD 1 TO WK-QPLAYS
           END-IF.
           IF WK-CARD4 = "Q"
              ADD 1 TO WK-QPLAYS
           END-IF.
           IF WK-CARD5 = "Q"
              ADD 1 TO WK-QPLAYS
           END-IF.
           IF WK-CARDTABLE1 = "Q"
              ADD 1 TO WK-QPLAYS
           END-IF.
           IF WK-CARDTABLE2 = "Q"
              ADD 1 TO WK-QPLAYS
           END-IF.
           IF WK-CARDTABLE3 = "Q"
              ADD 1 TO WK-QPLAYS
           END-IF.
           IF WK-CARDTABLE4 = "Q"
              ADD 1 TO WK-QPLAYS
           END-IF.
           IF WK-CARDTABLE5 = "Q"
              ADD 1 TO WK-QPLAYS
           END-IF.


           IF WK-CARD1 = "K"
              ADD 1 TO WK-KPLAYS
              MOVE 12 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "K"
              ADD 1 TO WK-KPLAYS
              MOVE 12 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "K"
              ADD 1 TO WK-KPLAYS
           END-IF.
           IF WK-CARD4 = "K"
              ADD 1 TO WK-KPLAYS
           END-IF.
           IF WK-CARD5 = "K"
              ADD 1 TO WK-KPLAYS
           END-IF.
           IF WK-CARDTABLE1 = "K"
              ADD 1 TO WK-KPLAYS
           END-IF.
           IF WK-CARDTABLE2 = "K"
              ADD 1 TO WK-KPLAYS
           END-IF.
           IF WK-CARDTABLE3 = "K"
              ADD 1 TO WK-KPLAYS
           END-IF.
           IF WK-CARDTABLE4 = "K"
              ADD 1 TO WK-KPLAYS
           END-IF.
           IF WK-CARDTABLE5 = "K"
              ADD 1 TO WK-KPLAYS
           END-IF.


           IF WK-CARD1 = "A"
              ADD 1 TO WK-APLAYS
              MOVE 13 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD2 = "A"
              ADD 1 TO WK-APLAYS
              MOVE 13 TO WK-PLAYERDRAW
           END-IF.
           IF WK-CARD3 = "A"
              ADD 1 TO WK-APLAYS
           END-IF.
           IF WK-CARD4 = "A"
              ADD 1 TO WK-APLAYS
           END-IF.
           IF WK-CARD5 = "A"
              ADD 1 TO WK-APLAYS
           END-IF.
           IF WK-CARDTABLE1 = "A"
              ADD 1 TO WK-APLAYS
           END-IF.
           IF WK-CARDTABLE2 = "A"
              ADD 1 TO WK-APLAYS
           END-IF.
           IF WK-CARDTABLE3 = "A"
              ADD 1 TO WK-APLAYS
           END-IF.
           IF WK-CARDTABLE4 = "A"
              ADD 1 TO WK-APLAYS
           END-IF.
           IF WK-CARDTABLE5 = "A"
              ADD 1 TO WK-APLAYS
           END-IF.


           IF WK-CARD1 = "A"
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              GO TO STRAIGHT2
           END-IF.
           IF WK-CARD2 = "A"
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              GO TO STRAIGHT2
           END-IF.
           IF WK-CARD3 = "A"
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              GO TO STRAIGHT2
           END-IF.
           IF WK-CARD4 = "A"
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              GO TO STRAIGHT2
           END-IF.
           IF WK-CARD5 = "A"
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              GO TO STRAIGHT2
           END-IF.
           IF WK-CARDTABLE1 = "A"
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              GO TO STRAIGHT2
           END-IF.
           IF WK-CARDTABLE2 = "A"
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              GO TO STRAIGHT2
           END-IF.
           IF WK-CARDTABLE3 = "A"
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              GO TO STRAIGHT2
           END-IF.
           IF WK-CARDTABLE4 = "A"
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              GO TO STRAIGHT2
           END-IF.
           IF WK-CARDTABLE5 = "A"
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              GO TO STRAIGHT2
           END-IF.


       STRAIGHT2.


           IF WK-CARD1 = "2"
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              GO TO STRAIGHT3
           END-IF.
           IF WK-CARD2 = "2"
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              GO TO STRAIGHT3
           END-IF.
           IF WK-CARD3 = "2"
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              GO TO STRAIGHT3
           END-IF.
           IF WK-CARD4 = "2"
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              GO TO STRAIGHT3
           END-IF.
           IF WK-CARD5 = "2"
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              GO TO STRAIGHT3
           END-IF.
           IF WK-CARDTABLE1 = "2"
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              GO TO STRAIGHT3
           END-IF.
           IF WK-CARDTABLE2 = "2"
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              GO TO STRAIGHT3
           END-IF.
           IF WK-CARDTABLE3 = "2"
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              GO TO STRAIGHT3
           END-IF.
           IF WK-CARDTABLE4 = "2"
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              GO TO STRAIGHT3
           END-IF.
           IF WK-CARDTABLE5 = "2"
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              GO TO STRAIGHT3
           END-IF.


       STRAIGHT3.


           IF WK-CARD1 = "3"
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              GO TO STRAIGHT4
           END-IF.
           IF WK-CARD2 = "3"
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              GO TO STRAIGHT4
           END-IF.
           IF WK-CARD3 = "3"
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              GO TO STRAIGHT4
           END-IF.
           IF WK-CARD4 = "3"
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              GO TO STRAIGHT4
           END-IF.
           IF WK-CARD5 = "3"
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              GO TO STRAIGHT4
           END-IF.
           IF WK-CARDTABLE1 = "3"
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              GO TO STRAIGHT4
           END-IF.
           IF WK-CARDTABLE2 = "3"
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              GO TO STRAIGHT4
           END-IF.
           IF WK-CARDTABLE3 = "3"
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              GO TO STRAIGHT4
           END-IF.
           IF WK-CARDTABLE4 = "3"
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              GO TO STRAIGHT4
           END-IF.
           IF WK-CARDTABLE5 = "3"
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              GO TO STRAIGHT4
           END-IF.

       STRAIGHT4.


           IF WK-CARD1 = "4"
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              GO TO STRAIGHT5
           END-IF.
           IF WK-CARD2 = "4"
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              GO TO STRAIGHT5
           END-IF.
           IF WK-CARD3 = "4"
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              GO TO STRAIGHT5
           END-IF.
           IF WK-CARD4 = "4"
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              GO TO STRAIGHT5
           END-IF.
           IF WK-CARD5 = "4"
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              GO TO STRAIGHT5
           END-IF.
           IF WK-CARDTABLE1 = "4"
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              GO TO STRAIGHT5
           END-IF.
           IF WK-CARDTABLE2 = "4"
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              GO TO STRAIGHT5
           END-IF.
           IF WK-CARDTABLE3 = "4"
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              GO TO STRAIGHT5
           END-IF.
           IF WK-CARDTABLE4 = "4"
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              GO TO STRAIGHT5
           END-IF.
           IF WK-CARDTABLE5 = "4"
              ADD 1 TO WK-KTO4
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              GO TO STRAIGHT5
           END-IF.


       STRAIGHT5.


           IF WK-CARD1 = "5"
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              GO TO STRAIGHT6
           END-IF.
           IF WK-CARD2 = "5"
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              GO TO STRAIGHT6
           END-IF.
           IF WK-CARD3 = "5"
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              GO TO STRAIGHT6
           END-IF.
           IF WK-CARD4 = "5"
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              GO TO STRAIGHT6
           END-IF.
           IF WK-CARD5 = "5"
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              GO TO STRAIGHT6
           END-IF.
           IF WK-CARDTABLE1 = "5"
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              GO TO STRAIGHT6
           END-IF.
           IF WK-CARDTABLE2 = "5"
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              GO TO STRAIGHT6
           END-IF.
           IF WK-CARDTABLE3 = "5"
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              GO TO STRAIGHT6
           END-IF.
           IF WK-CARDTABLE4 = "5"
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              GO TO STRAIGHT6
           END-IF.
           IF WK-CARDTABLE5 = "5"
              ADD 1 TO WK-ATO5
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              GO TO STRAIGHT6
           END-IF.


       STRAIGHT6.


           IF WK-CARD1 = "6"
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              GO TO STRAIGHT7
           END-IF.
           IF WK-CARD2 = "6"
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              GO TO STRAIGHT7
           END-IF.
           IF WK-CARD3 = "6"
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              GO TO STRAIGHT7
           END-IF.
           IF WK-CARD4 = "6"
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              GO TO STRAIGHT7
           END-IF.
           IF WK-CARD5 = "6"
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              GO TO STRAIGHT7
           END-IF.
           IF WK-CARDTABLE1 = "6"
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              GO TO STRAIGHT7
           END-IF.
           IF WK-CARDTABLE2 = "6"
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              GO TO STRAIGHT7
           END-IF.
           IF WK-CARDTABLE3 = "6"
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              GO TO STRAIGHT7
           END-IF.
           IF WK-CARDTABLE4 = "6"
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              GO TO STRAIGHT7
           END-IF.
           IF WK-CARDTABLE5 = "6"
              ADD 1 TO WK-2TO6
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              GO TO STRAIGHT7
           END-IF.

       STRAIGHT7.


           IF WK-CARD1 = "7"
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              GO TO STRAIGHT8
           END-IF.
           IF WK-CARD2 = "7"
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              GO TO STRAIGHT8
           END-IF.
           IF WK-CARD3 = "7"
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              GO TO STRAIGHT8
           END-IF.
           IF WK-CARD4 = "7"
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              GO TO STRAIGHT8
           END-IF.
           IF WK-CARD5 = "7"
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              GO TO STRAIGHT8
           END-IF.
           IF WK-CARDTABLE1 = "7"
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              GO TO STRAIGHT8
           END-IF.
           IF WK-CARDTABLE2 = "7"
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              GO TO STRAIGHT8
           END-IF.
           IF WK-CARDTABLE3 = "7"
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              GO TO STRAIGHT8
           END-IF.
           IF WK-CARDTABLE4 = "7"
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              GO TO STRAIGHT8
           END-IF.
           IF WK-CARDTABLE5 = "7"
              ADD 1 TO WK-3TO7
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              GO TO STRAIGHT8
           END-IF.

       STRAIGHT8.


           IF WK-CARD1 = "8"
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              GO TO STRAIGHT9
           END-IF.
           IF WK-CARD2 = "8"
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              GO TO STRAIGHT9
           END-IF.
           IF WK-CARD3 = "8"
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              GO TO STRAIGHT9
           END-IF.
           IF WK-CARD4 = "8"
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              GO TO STRAIGHT9
           END-IF.
           IF WK-CARD5 = "8"
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              GO TO STRAIGHT9
           END-IF.
           IF WK-CARDTABLE1 = "8"
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              GO TO STRAIGHT9
           END-IF.
           IF WK-CARDTABLE2 = "8"
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              GO TO STRAIGHT9
           END-IF.
           IF WK-CARDTABLE3 = "8"
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              GO TO STRAIGHT9
           END-IF.
           IF WK-CARDTABLE4 = "8"
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              GO TO STRAIGHT9
           END-IF.
           IF WK-CARDTABLE5 = "8"
              ADD 1 TO WK-4TO8
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              GO TO STRAIGHT9
           END-IF.

       STRAIGHT9.


           IF WK-CARD1 = "9"
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              GO TO STRAIGHT10
           END-IF.
           IF WK-CARD2 = "9"
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              GO TO STRAIGHT10
           END-IF.
           IF WK-CARD3 = "9"
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              GO TO STRAIGHT10
           END-IF.
           IF WK-CARD4 = "9"
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              GO TO STRAIGHT10
           END-IF.
           IF WK-CARD5 = "9"
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              GO TO STRAIGHT10
           END-IF.
           IF WK-CARDTABLE1 = "9"
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              GO TO STRAIGHT10
           END-IF.
           IF WK-CARDTABLE2 = "9"
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              GO TO STRAIGHT10
           END-IF.
           IF WK-CARDTABLE3 = "9"
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              GO TO STRAIGHT10
           END-IF.
           IF WK-CARDTABLE4 = "9"
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              GO TO STRAIGHT10
           END-IF.
           IF WK-CARDTABLE5 = "9"
              ADD 1 TO WK-5TO9
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              GO TO STRAIGHT10
           END-IF.


       STRAIGHT10.


           IF WK-CARD1 = "10"
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              GO TO STRAIGHTJ
           END-IF.
           IF WK-CARD2 = "10"
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              GO TO STRAIGHTJ
           END-IF.
           IF WK-CARD3 = "10"
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              GO TO STRAIGHTJ
           END-IF.
           IF WK-CARD4 = "10"
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              GO TO STRAIGHTJ
           END-IF.
           IF WK-CARD5 = "10"
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              GO TO STRAIGHTJ
           END-IF.
           IF WK-CARDTABLE1 = "10"
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              GO TO STRAIGHTJ
           END-IF.
           IF WK-CARDTABLE2 = "10"
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              GO TO STRAIGHTJ
           END-IF.
           IF WK-CARDTABLE3 = "10"
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              GO TO STRAIGHTJ
           END-IF.
           IF WK-CARDTABLE4 = "10"
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              GO TO STRAIGHTJ
           END-IF.
           IF WK-CARDTABLE5 = "10"
              ADD 1 TO WK-6TO10
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              GO TO STRAIGHTJ
           END-IF.


       STRAIGHTJ.


           IF WK-CARD1 = "J"
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              GO TO STRAIGHTQ
           END-IF.
           IF WK-CARD2 = "J"
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              GO TO STRAIGHTQ
           END-IF.
           IF WK-CARD3 = "J"
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              GO TO STRAIGHTQ
           END-IF.
           IF WK-CARD4 = "J"
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              GO TO STRAIGHTQ
           END-IF.
           IF WK-CARD5 = "J"
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              GO TO STRAIGHTQ
           END-IF.
           IF WK-CARDTABLE1 = "J"
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              GO TO STRAIGHTQ
           END-IF.
           IF WK-CARDTABLE2 = "J"
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              GO TO STRAIGHTQ
           END-IF.
           IF WK-CARDTABLE3 = "J"
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              GO TO STRAIGHTQ
           END-IF.
           IF WK-CARDTABLE4 = "J"
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              GO TO STRAIGHTQ
           END-IF.
           IF WK-CARDTABLE5 = "J"
              ADD 1 TO WK-7TOJ
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              GO TO STRAIGHTQ
           END-IF.


       STRAIGHTQ.


           IF WK-CARD1 = "Q"
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              GO TO STRAIGHTK
           END-IF.
           IF WK-CARD2 = "Q"
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              GO TO STRAIGHTK
           END-IF.
           IF WK-CARD3 = "Q"
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              GO TO STRAIGHTK
           END-IF.
           IF WK-CARD4 = "Q"
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              GO TO STRAIGHTK
           END-IF.
           IF WK-CARD5 = "Q"
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              GO TO STRAIGHTK
           END-IF.
           IF WK-CARDTABLE1 = "Q"
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              GO TO STRAIGHTK
           END-IF.
           IF WK-CARDTABLE2 = "Q"
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              GO TO STRAIGHTK
           END-IF.
           IF WK-CARDTABLE3 = "Q"
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              GO TO STRAIGHTK
           END-IF.
           IF WK-CARDTABLE4 = "Q"
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              GO TO STRAIGHTK
           END-IF.
           IF WK-CARDTABLE5 = "Q"
              ADD 1 TO WK-8TOQ
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              GO TO STRAIGHTK
           END-IF.


       STRAIGHTK.


           IF WK-CARD1 = "K"
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              GO TO ENDSTRAIGHT
           END-IF.
           IF WK-CARD2 = "K"
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              GO TO ENDSTRAIGHT
           END-IF.
           IF WK-CARD3 = "K"
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              GO TO ENDSTRAIGHT
           END-IF.
           IF WK-CARD4 = "K"
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              GO TO ENDSTRAIGHT
           END-IF.
           IF WK-CARD5 = "K"
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              GO TO ENDSTRAIGHT
           END-IF.
           IF WK-CARDTABLE1 = "K"
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              GO TO ENDSTRAIGHT
           END-IF.
           IF WK-CARDTABLE2 = "K"
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              GO TO ENDSTRAIGHT
           END-IF.
           IF WK-CARDTABLE3 = "K"
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              GO TO ENDSTRAIGHT
           END-IF.
           IF WK-CARDTABLE4 = "K"
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              GO TO ENDSTRAIGHT
           END-IF.
           IF WK-CARDTABLE5 = "K"
              ADD 1 TO WK-9TOK
              ADD 1 TO WK-10TOA
              ADD 1 TO WK-JTO2
              ADD 1 TO WK-QTO3
              ADD 1 TO WK-KTO4
              GO TO ENDSTRAIGHT
           END-IF.

       ENDSTRAIGHT.


      *CPU hand calculation


           IF WK-CARD1CPU = "2"
              ADD 1 TO WK-2PLAYSCPU
              MOVE 1 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "2"
              ADD 1 TO WK-2PLAYSCPU
              MOVE 1 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "2"
              ADD 1 TO WK-2PLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "2"
              ADD 1 TO WK-2PLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "2"
              ADD 1 TO WK-2PLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "2"
              ADD 1 TO WK-2PLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "2"
              ADD 1 TO WK-2PLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "2"
              ADD 1 TO WK-2PLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "2"
              ADD 1 TO WK-2PLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "2"
              ADD 1 TO WK-2PLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "3"
              ADD 1 TO WK-3PLAYSCPU
              MOVE 2 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "3"
              ADD 1 TO WK-3PLAYSCPU
              MOVE 2 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "3"
              ADD 1 TO WK-3PLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "3"
              ADD 1 TO WK-3PLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "3"
              ADD 1 TO WK-3PLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "3"
              ADD 1 TO WK-3PLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "3"
              ADD 1 TO WK-3PLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "3"
              ADD 1 TO WK-3PLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "3"
              ADD 1 TO WK-3PLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "3"
              ADD 1 TO WK-3PLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "4"
              ADD 1 TO WK-4PLAYSCPU
              MOVE 3 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "4"
              ADD 1 TO WK-4PLAYSCPU
              MOVE 3 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "4"
              ADD 1 TO WK-4PLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "4"
              ADD 1 TO WK-4PLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "4"
              ADD 1 TO WK-4PLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "4"
              ADD 1 TO WK-4PLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "4"
              ADD 1 TO WK-4PLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "4"
              ADD 1 TO WK-4PLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "4"
              ADD 1 TO WK-4PLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "4"
              ADD 1 TO WK-4PLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "5"
              ADD 1 TO WK-5PLAYSCPU
              MOVE 4 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "5"
              ADD 1 TO WK-5PLAYSCPU
              MOVE 4 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "5"
              ADD 1 TO WK-5PLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "5"
              ADD 1 TO WK-5PLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "5"
              ADD 1 TO WK-5PLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "5"
              ADD 1 TO WK-5PLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "5"
              ADD 1 TO WK-5PLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "5"
              ADD 1 TO WK-5PLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "5"
              ADD 1 TO WK-5PLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "5"
              ADD 1 TO WK-5PLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "6"
              ADD 1 TO WK-6PLAYSCPU
              MOVE 5 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "6"
              ADD 1 TO WK-6PLAYSCPU
              MOVE 5 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "6"
              ADD 1 TO WK-6PLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "6"
              ADD 1 TO WK-6PLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "6"
              ADD 1 TO WK-6PLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "6"
              ADD 1 TO WK-6PLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "6"
              ADD 1 TO WK-6PLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "6"
              ADD 1 TO WK-6PLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "6"
              ADD 1 TO WK-6PLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "6"
              ADD 1 TO WK-6PLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "7"
              ADD 1 TO WK-7PLAYSCPU
              MOVE 6 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "7"
              ADD 1 TO WK-7PLAYSCPU
              MOVE 6 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "7"
              ADD 1 TO WK-7PLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "7"
              ADD 1 TO WK-7PLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "7"
              ADD 1 TO WK-7PLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "7"
              ADD 1 TO WK-7PLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "7"
              ADD 1 TO WK-7PLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "7"
              ADD 1 TO WK-7PLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "7"
              ADD 1 TO WK-7PLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "7"
              ADD 1 TO WK-7PLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "8"
              ADD 1 TO WK-8PLAYSCPU
              MOVE 7 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "8"
              ADD 1 TO WK-8PLAYSCPU
              MOVE 7 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "8"
              ADD 1 TO WK-8PLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "8"
              ADD 1 TO WK-8PLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "8"
              ADD 1 TO WK-8PLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "8"
              ADD 1 TO WK-8PLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "8"
              ADD 1 TO WK-8PLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "8"
              ADD 1 TO WK-8PLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "8"
              ADD 1 TO WK-8PLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "8"
              ADD 1 TO WK-8PLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "9"
              ADD 1 TO WK-9PLAYSCPU
              MOVE 8 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "9"
              ADD 1 TO WK-9PLAYSCPU
              MOVE 8 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "9"
              ADD 1 TO WK-9PLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "9"
              ADD 1 TO WK-9PLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "9"
              ADD 1 TO WK-9PLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "9"
              ADD 1 TO WK-9PLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "9"
              ADD 1 TO WK-9PLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "9"
              ADD 1 TO WK-9PLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "9"
              ADD 1 TO WK-9PLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "9"
              ADD 1 TO WK-9PLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "10"
              ADD 1 TO WK-10PLAYSCPU
              MOVE 9 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "10"
              ADD 1 TO WK-10PLAYSCPU
              MOVE 9 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "10"
              ADD 1 TO WK-10PLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "10"
              ADD 1 TO WK-10PLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "10"
              ADD 1 TO WK-10PLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "10"
              ADD 1 TO WK-10PLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "10"
              ADD 1 TO WK-10PLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "10"
              ADD 1 TO WK-10PLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "10"
              ADD 1 TO WK-10PLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "10"
              ADD 1 TO WK-10PLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "J"
              ADD 1 TO WK-JPLAYSCPU
              MOVE 10 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "J"
              ADD 1 TO WK-JPLAYSCPU
              MOVE 10 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "J"
              ADD 1 TO WK-JPLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "J"
              ADD 1 TO WK-JPLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "J"
              ADD 1 TO WK-JPLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "J"
              ADD 1 TO WK-JPLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "J"
              ADD 1 TO WK-JPLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "J"
              ADD 1 TO WK-JPLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "J"
              ADD 1 TO WK-JPLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "J"
              ADD 1 TO WK-JPLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "Q"
              ADD 1 TO WK-QPLAYSCPU
              MOVE 11 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "Q"
              ADD 1 TO WK-QPLAYSCPU
              MOVE 11 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "Q"
              ADD 1 TO WK-QPLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "Q"
              ADD 1 TO WK-QPLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "Q"
              ADD 1 TO WK-QPLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "Q"
              ADD 1 TO WK-QPLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "Q"
              ADD 1 TO WK-QPLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "Q"
              ADD 1 TO WK-QPLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "Q"
              ADD 1 TO WK-QPLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "Q"
              ADD 1 TO WK-QPLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "K"
              ADD 1 TO WK-KPLAYSCPU
              MOVE 12 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "K"
              ADD 1 TO WK-KPLAYSCPU
              MOVE 12 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "K"
              ADD 1 TO WK-KPLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "K"
              ADD 1 TO WK-KPLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "K"
              ADD 1 TO WK-KPLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "K"
              ADD 1 TO WK-KPLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "K"
              ADD 1 TO WK-KPLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "K"
              ADD 1 TO WK-KPLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "K"
              ADD 1 TO WK-KPLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "K"
              ADD 1 TO WK-KPLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "A"
              ADD 1 TO WK-APLAYSCPU
              MOVE 13 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD2CPU = "A"
              ADD 1 TO WK-APLAYSCPU
              MOVE 13 TO WK-CPUDRAW
           END-IF.
           IF WK-CARD3CPU = "A"
              ADD 1 TO WK-APLAYSCPU
           END-IF.
           IF WK-CARD4CPU = "A"
              ADD 1 TO WK-APLAYSCPU
           END-IF.
           IF WK-CARD5CPU = "A"
              ADD 1 TO WK-APLAYSCPU
           END-IF.
           IF WK-CARDTABLE1 = "A"
              ADD 1 TO WK-APLAYSCPU
           END-IF.
           IF WK-CARDTABLE2 = "A"
              ADD 1 TO WK-APLAYSCPU
           END-IF.
           IF WK-CARDTABLE3 = "A"
              ADD 1 TO WK-APLAYSCPU
           END-IF.
           IF WK-CARDTABLE4 = "A"
              ADD 1 TO WK-APLAYSCPU
           END-IF.
           IF WK-CARDTABLE5 = "A"
              ADD 1 TO WK-APLAYSCPU
           END-IF.


           IF WK-CARD1CPU = "A"
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              GO TO STRAIGHTCPU2
           END-IF.
           IF WK-CARD2CPU = "A"
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              GO TO STRAIGHTCPU2
           END-IF.
           IF WK-CARD3CPU = "A"
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              GO TO STRAIGHTCPU2
           END-IF.
           IF WK-CARD4CPU = "A"
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              GO TO STRAIGHTCPU2
           END-IF.
           IF WK-CARD5CPU = "A"
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              GO TO STRAIGHTCPU2
           END-IF.
           IF WK-CARDTABLE1 = "A"
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              GO TO STRAIGHTCPU2
           END-IF.
           IF WK-CARDTABLE2 = "A"
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              GO TO STRAIGHTCPU2
           END-IF.
           IF WK-CARDTABLE3 = "A"
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              GO TO STRAIGHTCPU2
           END-IF.
           IF WK-CARDTABLE4 = "A"
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              GO TO STRAIGHTCPU2
           END-IF.
           IF WK-CARDTABLE5 = "A"
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              GO TO STRAIGHTCPU2
           END-IF.


       STRAIGHTCPU2.


           IF WK-CARD1CPU = "2"
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              GO TO STRAIGHTCPU3
           END-IF.
           IF WK-CARD2CPU = "2"
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              GO TO STRAIGHTCPU3
           END-IF.
           IF WK-CARD3CPU = "2"
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              GO TO STRAIGHTCPU3
           END-IF.
           IF WK-CARD4CPU = "2"
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              GO TO STRAIGHTCPU3
           END-IF.
           IF WK-CARD5CPU = "2"
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              GO TO STRAIGHTCPU3
           END-IF.
           IF WK-CARDTABLE1 = "2"
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              GO TO STRAIGHTCPU3
           END-IF.
           IF WK-CARDTABLE2 = "2"
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              GO TO STRAIGHTCPU3
           END-IF.
           IF WK-CARDTABLE3 = "2"
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              GO TO STRAIGHTCPU3
           END-IF.
           IF WK-CARDTABLE4 = "2"
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              GO TO STRAIGHTCPU3
           END-IF.
           IF WK-CARDTABLE5 = "2"
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              GO TO STRAIGHTCPU3
           END-IF.


       STRAIGHTCPU3.


           IF WK-CARD1CPU = "3"
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              GO TO STRAIGHTCPU4
           END-IF.
           IF WK-CARD2CPU = "3"
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              GO TO STRAIGHTCPU4
           END-IF.
           IF WK-CARD3CPU = "3"
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              GO TO STRAIGHTCPU4
           END-IF.
           IF WK-CARD4CPU = "3"
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              GO TO STRAIGHTCPU4
           END-IF.
           IF WK-CARD5CPU = "3"
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              GO TO STRAIGHTCPU4
           END-IF.
           IF WK-CARDTABLE1 = "3"
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              GO TO STRAIGHTCPU4
           END-IF.
           IF WK-CARDTABLE2 = "3"
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              GO TO STRAIGHTCPU4
           END-IF.
           IF WK-CARDTABLE3 = "3"
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              GO TO STRAIGHTCPU4
           END-IF.
           IF WK-CARDTABLE4 = "3"
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              GO TO STRAIGHTCPU4
           END-IF.
           IF WK-CARDTABLE5 = "3"
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              GO TO STRAIGHTCPU4
           END-IF.

       STRAIGHTCPU4.


           IF WK-CARD1CPU = "4"
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              GO TO STRAIGHTCPU5
           END-IF.
           IF WK-CARD2CPU = "4"
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              GO TO STRAIGHTCPU5
           END-IF.
           IF WK-CARD3CPU = "4"
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              GO TO STRAIGHTCPU5
           END-IF.
           IF WK-CARD4CPU = "4"
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              GO TO STRAIGHTCPU5
           END-IF.
           IF WK-CARD5CPU = "4"
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              GO TO STRAIGHTCPU5
           END-IF.
           IF WK-CARDTABLE1 = "4"
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              GO TO STRAIGHTCPU5
           END-IF.
           IF WK-CARDTABLE2 = "4"
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              GO TO STRAIGHTCPU5
           END-IF.
           IF WK-CARDTABLE3 = "4"
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              GO TO STRAIGHTCPU5
           END-IF.
           IF WK-CARDTABLE4 = "4"
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              GO TO STRAIGHTCPU5
           END-IF.
           IF WK-CARDTABLE5 = "4"
              ADD 1 TO WK-KTO4CPU
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              GO TO STRAIGHTCPU5
           END-IF.


       STRAIGHTCPU5.


           IF WK-CARD1CPU = "5"
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              GO TO STRAIGHTCPU6
           END-IF.
           IF WK-CARD2CPU = "5"
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              GO TO STRAIGHTCPU6
           END-IF.
           IF WK-CARD3CPU = "5"
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              GO TO STRAIGHTCPU6
           END-IF.
           IF WK-CARD4CPU = "5"
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              GO TO STRAIGHTCPU6
           END-IF.
           IF WK-CARD5CPU = "5"
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              GO TO STRAIGHTCPU6
           END-IF.
           IF WK-CARDTABLE1 = "5"
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              GO TO STRAIGHTCPU6
           END-IF.
           IF WK-CARDTABLE2 = "5"
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              GO TO STRAIGHTCPU6
           END-IF.
           IF WK-CARDTABLE3 = "5"
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              GO TO STRAIGHTCPU6
           END-IF.
           IF WK-CARDTABLE4 = "5"
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              GO TO STRAIGHTCPU6
           END-IF.
           IF WK-CARDTABLE5 = "5"
              ADD 1 TO WK-ATO5CPU
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              GO TO STRAIGHTCPU6
           END-IF.


       STRAIGHTCPU6.


           IF WK-CARD1CPU = "6"
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              GO TO STRAIGHTCPU7
           END-IF.
           IF WK-CARD2CPU = "6"
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              GO TO STRAIGHTCPU7
           END-IF.
           IF WK-CARD3CPU = "6"
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              GO TO STRAIGHTCPU7
           END-IF.
           IF WK-CARD4CPU = "6"
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              GO TO STRAIGHTCPU7
           END-IF.
           IF WK-CARD5CPU = "6"
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              GO TO STRAIGHTCPU7
           END-IF.
           IF WK-CARDTABLE1 = "6"
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              GO TO STRAIGHTCPU7
           END-IF.
           IF WK-CARDTABLE2 = "6"
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              GO TO STRAIGHTCPU7
           END-IF.
           IF WK-CARDTABLE3 = "6"
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              GO TO STRAIGHTCPU7
           END-IF.
           IF WK-CARDTABLE4 = "6"
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              GO TO STRAIGHTCPU7
           END-IF.
           IF WK-CARDTABLE5 = "6"
              ADD 1 TO WK-2TO6CPU
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              GO TO STRAIGHTCPU7
           END-IF.

       STRAIGHTCPU7.


           IF WK-CARD1CPU = "7"
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              GO TO STRAIGHTCPU8
           END-IF.
           IF WK-CARD2CPU = "7"
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              GO TO STRAIGHTCPU8
           END-IF.
           IF WK-CARD3CPU = "7"
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              GO TO STRAIGHTCPU8
           END-IF.
           IF WK-CARD4CPU = "7"
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              GO TO STRAIGHTCPU8
           END-IF.
           IF WK-CARD5CPU = "7"
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              GO TO STRAIGHTCPU8
           END-IF.
           IF WK-CARDTABLE1 = "7"
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              GO TO STRAIGHTCPU8
           END-IF.
           IF WK-CARDTABLE2 = "7"
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              GO TO STRAIGHTCPU8
           END-IF.
           IF WK-CARDTABLE3 = "7"
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              GO TO STRAIGHTCPU8
           END-IF.
           IF WK-CARDTABLE4 = "7"
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              GO TO STRAIGHTCPU8
           END-IF.
           IF WK-CARDTABLE5 = "7"
              ADD 1 TO WK-3TO7CPU
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              GO TO STRAIGHTCPU8
           END-IF.

       STRAIGHTCPU8.


           IF WK-CARD1CPU = "8"
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              GO TO STRAIGHTCPU9
           END-IF.
           IF WK-CARD2CPU = "8"
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              GO TO STRAIGHTCPU9
           END-IF.
           IF WK-CARD3CPU = "8"
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              GO TO STRAIGHTCPU9
           END-IF.
           IF WK-CARD4CPU = "8"
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              GO TO STRAIGHTCPU9
           END-IF.
           IF WK-CARD5CPU = "8"
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              GO TO STRAIGHTCPU9
           END-IF.
           IF WK-CARDTABLE1 = "8"
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              GO TO STRAIGHTCPU9
           END-IF.
           IF WK-CARDTABLE2 = "8"
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              GO TO STRAIGHTCPU9
           END-IF.
           IF WK-CARDTABLE3 = "8"
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              GO TO STRAIGHTCPU9
           END-IF.
           IF WK-CARDTABLE4 = "8"
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              GO TO STRAIGHTCPU9
           END-IF.
           IF WK-CARDTABLE5 = "8"
              ADD 1 TO WK-4TO8CPU
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              GO TO STRAIGHTCPU9
           END-IF.

       STRAIGHTCPU9.


           IF WK-CARD1CPU = "9"
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              GO TO STRAIGHTCPU10
           END-IF.
           IF WK-CARD2CPU = "9"
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              GO TO STRAIGHTCPU10
           END-IF.
           IF WK-CARD3CPU = "9"
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              GO TO STRAIGHTCPU10
           END-IF.
           IF WK-CARD4CPU = "9"
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              GO TO STRAIGHTCPU10
           END-IF.
           IF WK-CARD5CPU = "9"
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              GO TO STRAIGHTCPU10
           END-IF.
           IF WK-CARDTABLE1 = "9"
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              GO TO STRAIGHTCPU10
           END-IF.
           IF WK-CARDTABLE2 = "9"
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              GO TO STRAIGHTCPU10
           END-IF.
           IF WK-CARDTABLE3 = "9"
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              GO TO STRAIGHTCPU10
           END-IF.
           IF WK-CARDTABLE4 = "9"
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              GO TO STRAIGHTCPU10
           END-IF.
           IF WK-CARDTABLE5 = "9"
              ADD 1 TO WK-5TO9CPU
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              GO TO STRAIGHTCPU10
           END-IF.


       STRAIGHTCPU10.


           IF WK-CARD1CPU = "10"
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              GO TO STRAIGHTCPUJ
           END-IF.
           IF WK-CARD2CPU = "10"
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              GO TO STRAIGHTCPUJ
           END-IF.
           IF WK-CARD3CPU = "10"
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              GO TO STRAIGHTCPUJ
           END-IF.
           IF WK-CARD4CPU = "10"
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              GO TO STRAIGHTCPUJ
           END-IF.
           IF WK-CARD5CPU = "10"
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              GO TO STRAIGHTCPUJ
           END-IF.
           IF WK-CARDTABLE1 = "10"
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              GO TO STRAIGHTCPUJ
           END-IF.
           IF WK-CARDTABLE2 = "10"
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              GO TO STRAIGHTCPUJ
           END-IF.
           IF WK-CARDTABLE3 = "10"
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              GO TO STRAIGHTCPUJ
           END-IF.
           IF WK-CARDTABLE4 = "10"
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              GO TO STRAIGHTCPUJ
           END-IF.
           IF WK-CARDTABLE5 = "10"
              ADD 1 TO WK-6TO10CPU
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              GO TO STRAIGHTCPUJ
           END-IF.


       STRAIGHTCPUJ.


           IF WK-CARD1CPU = "J"
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              GO TO STRAIGHTCPUQ
           END-IF.
           IF WK-CARD2CPU = "J"
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              GO TO STRAIGHTCPUQ
           END-IF.
           IF WK-CARD3CPU = "J"
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              GO TO STRAIGHTCPUQ
           END-IF.
           IF WK-CARD4CPU = "J"
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              GO TO STRAIGHTCPUQ
           END-IF.
           IF WK-CARD5CPU = "J"
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              GO TO STRAIGHTCPUQ
           END-IF.
           IF WK-CARDTABLE1 = "J"
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              GO TO STRAIGHTCPUQ
           END-IF.
           IF WK-CARDTABLE2 = "J"
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              GO TO STRAIGHTCPUQ
           END-IF.
           IF WK-CARDTABLE3 = "J"
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              GO TO STRAIGHTCPUQ
           END-IF.
           IF WK-CARDTABLE4 = "J"
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              GO TO STRAIGHTCPUQ
           END-IF.
           IF WK-CARDTABLE5 = "J"
              ADD 1 TO WK-7TOJCPU
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              GO TO STRAIGHTCPUQ
           END-IF.


       STRAIGHTCPUQ.


           IF WK-CARD1CPU = "Q"
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              GO TO STRAIGHTCPUK
           END-IF.
           IF WK-CARD2CPU = "Q"
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              GO TO STRAIGHTCPUK
           END-IF.
           IF WK-CARD3CPU = "Q"
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              GO TO STRAIGHTCPUK
           END-IF.
           IF WK-CARD4CPU = "Q"
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              GO TO STRAIGHTCPUK
           END-IF.
           IF WK-CARD5CPU = "Q"
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              GO TO STRAIGHTCPUK
           END-IF.
           IF WK-CARDTABLE1 = "Q"
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              GO TO STRAIGHTCPUK
           END-IF.
           IF WK-CARDTABLE2 = "Q"
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              GO TO STRAIGHTCPUK
           END-IF.
           IF WK-CARDTABLE3 = "Q"
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              GO TO STRAIGHTCPUK
           END-IF.
           IF WK-CARDTABLE4 = "Q"
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              GO TO STRAIGHTCPUK
           END-IF.
           IF WK-CARDTABLE5 = "Q"
              ADD 1 TO WK-8TOQCPU
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              GO TO STRAIGHTCPUK
           END-IF.


       STRAIGHTCPUK.


           IF WK-CARD1CPU = "K"
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              GO TO ENDSTRAIGHTCPU
           END-IF.
           IF WK-CARD2CPU = "K"
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              GO TO ENDSTRAIGHTCPU
           END-IF.
           IF WK-CARD3CPU = "K"
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              GO TO ENDSTRAIGHTCPU
           END-IF.
           IF WK-CARD4CPU = "K"
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              GO TO ENDSTRAIGHTCPU
           END-IF.
           IF WK-CARD5CPU = "K"
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              GO TO ENDSTRAIGHTCPU
           END-IF.
           IF WK-CARDTABLE1 = "K"
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              GO TO ENDSTRAIGHTCPU
           END-IF.
           IF WK-CARDTABLE2 = "K"
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              GO TO ENDSTRAIGHTCPU
           END-IF.
           IF WK-CARDTABLE3 = "K"
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              GO TO ENDSTRAIGHTCPU
           END-IF.
           IF WK-CARDTABLE4 = "K"
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              GO TO ENDSTRAIGHTCPU
           END-IF.
           IF WK-CARDTABLE5 = "K"
              ADD 1 TO WK-9TOKCPU
              ADD 1 TO WK-10TOACPU
              ADD 1 TO WK-JTO2CPU
              ADD 1 TO WK-QTO3CPU
              ADD 1 TO WK-KTO4CPU
              GO TO ENDSTRAIGHTCPU
           END-IF.

       ENDSTRAIGHTCPU.